# IFCGuidKey Class

---
IFCGuidKey is used for case-sensitive comparison of GUID values for maps and sets.
SystemObject Autodesk.Revit.DB.IFCIFCGuidKey
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCGuidKey : IDisposable

    Public Class IFCGuidKey
    	Implements IDisposable

    public ref class IFCGuidKey : IDisposable

    type IFCGuidKey =
        class
            interface IDisposable
        end
The IFCGuidKey type exposes the following members.
| Name| Description
---|---|---
| IFCGuidKey(IFCGuidKey)|  IFCGuidKey can be used in managed code as well as unmanaged.
| IFCGuidKey(String)|  Constructs a new IFCHybridGuid
Top
| Name| Description
---|---|---
| IFCGlobalId|  IFC GlobalId for map.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IFCGuidKey
| Equals|  Determines whether this IFCGuidKey is equal to another. (Overrides ObjectEquals(Object))
| GetHashCode|  Returns the hash code for this IFCGuidKey (Overrides ObjectGetHashCode)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.IFC Namespace